app/controllers/bakeries_controller.rb

SELECT "bakeries".* FROM "bakeries"
---
  def index
    @bakeries = Bakery.all

SELECT  "bakeries".* FROM "bakeries" WHERE "bakeries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @bakery = Bakery.find(params[:id])