app/controllers/candies_controller.rb

SELECT "candies".* FROM "candies"
---
  def index
    @candies = Candy.all.only_true

SELECT  "candies".* FROM "candies" WHERE "candies"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
---
  def show
    @candy = Candy.find(params[:id])