app/controllers/pastries_controller.rb

SELECT "pastries".* FROM "pastries"
---
  def index
    @pastries = Pastry.all

SELECT  "pastries".* FROM "pastries" WHERE "pastries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @pastry = Pastry.find(params[:id])