app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops" ORDER BY "shops"."created_at" DESC
---
  def index
    @shops = Shop.all.newest_first

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "candies" WHERE "candies"."shop_id" = $1  [["shop_id", 3]]
---
  def show
    @shop = Shop.find(params[:id])
    @count_candy = @shop.candies.count

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def candies
    @shop = Shop.find(params[:shop_id])